0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(warmPlace1|warmPlace2|coldPlace)"
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 20);
    }
    outlet
    {
        type            zeroGradient;
    }
    allBoundaries
    {
       type             fixedValue;
       value            $internalField;
    }
    atmosphere
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
