0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 290;

boundaryField
{
  
    coldPlace
    {
        type            fixedValue;
        value           uniform 290;
    }
    warmPlace1
    {
        type            fixedValue;
        value           uniform 300;
    }
    warmPlace2
    {
        type            fixedValue;
        value           uniform 300;
    }
    "(inlet|outlet|allBoundaries|atmosphere)"
    {
        type            fixedValue;
        value           $internalField;
    }
    
    

    
}

// ************************************************************************* //
