0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(warmPlace1|warmPlace2|coldPlace)"
    {
        type            compressible::alphatJayatillekeWallFunction;
        Prt             0;
        value           $internalField;
    }
    "(inlet|outlet|allBoundaries|atmosphere)"
    {
        type            calculated;
        value           uniform 0;
    }


  
}



// ************************************************************************* //
