0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(warmPlace1|warmPlace2|coldPlace)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    "(inlet|outlet|allBoundaries|atmosphere)"
    {
        type            fixedValue;
        value           $internalField;
    }


    
}

// ************************************************************************* //
